// service/protocol/index.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    nodes: ''
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {
    this.setData({
      nodes: "<h3><b>福特派条款与隐私政策<\/b><\/h3>\n<h3><b>（\u201c条款\u201d）<\/b><\/h3>\n<p>请仔细阅读本协议，\u201cGo Ride 随到\u201dApp平台将依据以下条件和条款为您提供服务。<\/p>\n<p>本协议阐述之条款和条件适用于您使用\u201cGo Ride 随到\u201dApp平台所提供的各种服务。<\/p>\n<p><b>1．服务条款的确认<\/b><\/p>\n<p>\u201cGo Ride 随到\u201dApp平台根据本服务条款及对该条款的修改向用户提供服务。本服务条款具有合同法上的法律效力。<\/p>\n<p>自您通过注册程序始，即表示您自愿接受本协议之所有条款，并已成为\u201cGo Ride 随到\u201dApp平台的注册会员。用户在使用 \u201cGo Ride 随到\u201dApp平台的同时，同意接受\u201cGo Ride 随到\u201dApp平台会员服务提供的各类信息服务，如果您对协议的任何条款表示异议，您可以选择不注册或向\u201cGo Ride 随到\u201d咨询。<\/p>\n<p><b>2. 服务内容及修改、中断、终止<\/b><\/p>\n<p>2.1 \u201cGo Ride 随到\u201dApp平台服务的具体内容由本平台根据实际情况提供，并对所提供之服务拥有最终解释权。<\/p>\n<p>2.2 \u201cGo Ride 随到\u201dApp平台仅向其注册用户提供相关服务，与相关服务有关的设备（如个人手机、及其他与接入互联网或移动网有关的装置）及所需的费用（如为接入互联网而支付的电话费及上网费、为使用移动网而支付的手机费）均由会员自行负担。<\/p>\n<p>2.3 鉴于网络服务的特殊性，用户同意\u201cGo Ride 随到\u201dApp平台有权不经事先通知，随时变更、中断或终止部分或全部的网络服务（包括收费网络服务）。\u201cGo Ride 随到\u201dApp平台不担保网络服务不会中断，对网络服务的及时性、安全性、准确性也都不作担保。<\/p>\n<p><b>3．会员帐号及密码<\/b><\/p>\n<p>用户注册会员成功后，\u201cGo Ride 随到\u201dApp平台将给予每个会员一个帐号及相应的密码，该帐号和密码由用户负责保管；用户应当对以其用户帐号进行的所有活动和事件负法律责任。因黑客行为或会员保管疏忽致使帐号、密码被他人非法使用的，本公司不承担任何责任。如您发现任何非法使用会员帐号或安全漏洞的情况，请立即与本公司联系。<\/p>\n<p><b>4. 注册信息和隐私保护<\/b><\/p>\n<p>4.1 \u201cGo Ride 随到\u201dApp平台帐号（即\u201cGo Ride 随到\u201dApp平台用户ID）的所有权归\u201cGo Ride 随到\u201dApp平台，用户完成注册申请手续后，获得\u201cGo Ride 随到\u201dApp平台帐号的使用权。用户应提供及时、详尽及准确的个人资料，并不断更新注册资料，符合及时、详尽准确的要求。所有原始键入的资料将作为注册资料。如果因用户注册信息不真实而引起的问题及其产生的后果\u201cGo Ride 随到\u201dApp平台不负任何责任。<\/p>\n<p>4.2 用户不得将其帐号、密码转让或出借予他人使用。如发现其帐号遭他人非法使用，应立即通知\u201cGo Ride 随到\u201dApp平台。<\/p>\n<p>4.3 \u201cGo Ride 随到\u201dApp平台不对外公开或向第三方提供单个用户的注册资料，除非：<\/p>\n<p>事先获得用户的明确授权；<\/p>\n<p>只有透露你的个人资料，才能提供你所要求的产品和服务；<\/p>\n<p>根据有关的法律法规要求；<\/p>\n<p>按照相关政府主管部门的要求；<\/p>\n<p>为维护\u201cGo Ride 随到\u201dApp平台的合法权益。<\/p>\n<p>4.4 在您注册\u201cGo Ride 随到\u201dApp平台帐户，使用\u201cGo Ride 随到\u201dApp平台产品或服务，或访问\u201cGo Ride 随到\u201dApp平台网页时，\u201cGo Ride 随到\u201dApp平台会收集您的个人身份识别资料，并会将这些资料用于：改进为您提供的服务及网页内容。<\/p>\n<p><b>5. 用户权责<\/b><\/p>\n<p>5.1 用户违反本协议或相关的服务条款的规定，导致或产生的任何第三方主张的任何索赔、要求或损失，包括合理的律师费，您同意赔偿\u201cGo Ride 随到\u201dApp平台与合作公司、关联公司，并使之免受损害。对此，\u201cGo Ride 随到\u201dApp平台有权视用户的行为性质，采取包括但不限于删除用户发布信息内容、暂停使用许可、终止服务、限制使用、回收\u201cGo Ride 随到\u201dApp平台帐号、追究法律责任等措施。对恶意注册\u201cGo Ride 随到\u201dApp平台帐号或利用\u201cGo Ride 随到\u201dApp平台帐号进行违法活动、捣乱、骚扰、欺骗、其他用户以及其他违反本协议的行为，\u201cGo Ride 随到\u201dApp平台有权回收其帐号。同时，本公司会视司法部门的要求，协助调查。<\/p>\n<p>5.2 用户不得对\u201cGo Ride 随到\u201dApp平台任何部分通过任何方式进行复制、拷贝、出售、转售或用于任何其它商业目的。<\/p>\n<p>5.3 用户须对自己在使用\u201cGo Ride 随到\u201dApp平台服务过程中的行为承担法律责任。用户承担法律责任的形式包括但不限于：对受到侵害者进行赔偿，以及在\u201cGo Ride 随到\u201dApp平台运营公司首先承担了因用户行为导致的行政处罚或侵权损害赔偿责任后，用户应给予\u201cGo Ride 随到\u201dApp平台运营公司等额的赔偿。<\/p>\n<p><b>6. 知识产权<\/b><\/p>\n<p>6.1 \u201cGo Ride 随到\u201dApp平台网站及网站所使用的任何相关软件、程序、内容，包括但不限于作品、图片、档案、资料、网站构架、网站版面的安排、网页设计、经由本网站或广告商向用户呈现的广告或资讯，均由本公司或其它权利人依法享有相应的知识产权，包括但不限于著作权、商标权、专利权或其它专属权利等，受到相关法律的保护。未经本公司或权利人明示授权，用户保证不修改、出租、出借、出售、散布本平台及本平台所使用的上述任何资料和资源，或根据上述资料和资源制作成任何种类物品。<\/p>\n<p>6.2 本公司授予用户不可转移及非专属的使用权，使用户可以通过单机计算机使用本网站的目标代码（以下简称\u201c软件\u201d），但用户不得且不得允许任何第三方，复制、修改、创作衍生作品、进行还原工程、反向组译，或以其它方式破译或试图破译源代码，或出售、转让\u201c软件\u201d或对\u201c软件\u201d进行再授权，或以其它方式移转\u201c软件\u201d之任何权利。用户同意不以任何方式修改\u201c软件\u201d，或使用修改后的\u201c软件\u201d。<\/p>\n<p>6.3 \u201cGo Ride 随到\u201cApp平台有权在所有由平台提供的功能界面标注\u201c此功能由\u201dGo Ride 随到\u201cApp平台提供\u201c等相关版权信息。<\/p>\n<p>6.4 用户不得经由非\u201cGo Ride 随到\u201dApp平台所提供的界面使用本网站。<\/p>\n<p><b>7. 其他<\/b><\/p>\n<p>7.1 本应用仅限于福特汽车工程研究（南京）有限公司员工内部测试使用。<\/p>\n<p>7.2因不可抗力或者其他意外事件，使得本协议的履行不可能、不必要或者无意义的，双方均不承担责任。本协议所称之不可抗力意指不能预见、不能避免并不能克服的客观情况，包括但不限于战争、台风、水灾、火灾、雷击或地震、罢工、暴动、法定疾病、黑客攻击、网络病毒、电信部门技术管制、政府行为或任何其它自然或人为造成的灾难等客观情况。<\/p>\n<p>7.3 本条款及其修订本的有效性、履行和与本条款及其修订本效力有关的所有事宜，将受中华人民共和国法律约束，任何争议仅适用中华人民共和国法律。<\/p>\n<p>7.4 因本条款所引起的用户与本公司的任何纠纷或争议，首先应友好协商解决，协商不成的，用户在此同意将纠纷或争议提交本公司住所地有管辖权的人民法院诉讼解决。<\/p>\n<p>7.5用户正确提交注册程序所需的资料并确认本协议后，本协议在\u201cGo Ride 随到\u201dApp平台与用户之间成立并生效。<\/p>\n<p>7.6本协议生效前的注册用户只需要使用原用户名及密码登录\u201cGo Ride 随到\u201dApp平台网站重新接受并确认本协议，即可继续使用\u201cGo Ride 随到\u201dApp平台的服务。<\/p>\n<p>7.7协议有效期：从用户同意本协议或使用\u201cGo Ride 随到\u201dApp平台起至用户注销\u201cGo Ride 随到\u201dApp平台服务止。<\/p>\n<p>7.8本协议如无特殊规定，双方应当使用电子邮件方式就本协议相关事项进行联系。<\/p>\n<p>7.9\u201cGo Ride 随到\u201dApp平台相关部门的电子邮箱以在\u201cGo Ride 随到\u201dApp上注明的为准。<\/p>\n<p>7.10使用\u201cGo Ride 随到\u201dApp平台即表示接受\u201cGo Ride 随到\u201dApp平台服务协议及其所有附件。<\/p>\n<p>7.11本协议的最终解释权归\u201cGo Ride 随到\u201dApp平台所有。<\/p>\n"
    })
  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {

  }
})